---
type: AnalysisDisplayVectorSettings
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 12
tags: [revit-api, class]
---

# AnalysisDisplayVectorSettings

`Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings` · Revit 2024 · 12 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | AnalysisDisplayVectorSettings | — | `` |
| Constructor | AnalysisDisplayVectorSettings | 2012 | `public AnalysisDisplayVectorSettings ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | IsEqual | 2012 | `public bool IsEqual ( AnalysisDisplayVectorSettings other )` |
| Property | ArrowLineWeight | 2012 | `public int ArrowLineWeight { get ; set ; }` |
| Property | ArrowheadScale | 2012 | `public AnalysisDisplayStyleVectorArrowheadScale ArrowheadScale { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Rounding | 2012 | `public double Rounding { get ; set ; }` |
| Property | TextTypeId | 2012 | `public ElementId TextTypeId { get ; set ; }` |
| Property | VectorOrientation | 2012 | `public AnalysisDisplayStyleVectorOrientation VectorOrientation { get ; set ; }` |
| Property | VectorPosition | 2012 | `public AnalysisDisplayStyleVectorPosition VectorPosition { get ; set ; }` |
| Property | VectorTextType | 2012 | `public AnalysisDisplayStyleVectorTextType VectorTextType { get ; set ; }` |